<?php
    include_once(__DIR__."/../framework/view.class.php");
    include_once(__DIR__."/../model/Utilisateur.class.php");
    include_once(__DIR__."/../model/Article.class.php");
    include_once(__DIR__."/../model/Enchere.class.php");



    /***************************************************************************
    **                         Données de l'enchère
    ***************************************************************************/


    /***************************************************************************
    **                         Données de l'article
    ***************************************************************************/
    
    



    /***************************************************************************
    **                         Création de l'enchère et de l'article
    ***************************************************************************/


    $enchere = new Enchere();

    
    /***************************************************************************
    **                         Construction de la vue
    ***************************************************************************/

    $view = new View();
    
    // données de l'enchère

    // données de l'article

    $view->display("z.test.créerEnchère.view.php")
?>